import React from "react";

const About = () => {
  return (
    <div>
      {/* <div>
        안녕하세요. 프론트엔드 개발자 전진희입니다. 저는 중국 칭화대학교의
        정보디자인과를 졸업했습니다.(2011 - 2015) 졸업 후, 순수 미술을
        공부하고자 독일로 갔고 2년 가까이 거주했으나, 진학 문제로 한국으로
        돌아오게 되었습니다. 이후 카페 일을 하며 돈을 벌어 워킹홀리데이 비자를
        통해 오스트리아에서 약 6개월 간 체류했습니다. 오스트리아에 거주할 때
        코로나가 발생했고 외출 금지령이 내려졌을 당시 코딩을 알게 되었습니다.
        처음엔 취미로 한번 배워볼까하고 시작했던 것이 재미를 느끼게 되어
        한국으로 돌아와 본격적으로 공부하게 되었습니다. 저는 독학으로 유튜브나
        무료강의를 따라하고, 도서관에 가서 책도 빌려보며 공부를 시작했습니다.
      </div>
      <div>
        경력 푸드넷24 (2022. 03 ~ 2023. 02) 저는 Vue를 사용해 CMS페이지의
        프론트엔드 개발을 맡았습니다. 회사에서의 프론트엔드 개발자는 저뿐이었고,
        작업의 기초 셋팅과 CMS페이지의 회원가입 / 로그인 / 운영자리스트 같은
        기본 작업은 외주 개발자 분들을 통해 되어있는 상태였습니다. 저는 운영자와
        점주(ROLE)에 따른 쿠폰 관리 / 공지사항&이벤트 / 문의 사항 / 가게 관리 /
        결제 & 정산 관리(리스트 / 대시보드) 페이지의 목록을 불러오고 등록, 수정,
        삭제를 하는 작업했고, 회원가입 / 비밀번호 찾기에 들어가는 휴대폰
        인증이나 카카오 맵 연동하여 주소를 삽입하는 추가 작업을 했습니다. CMS
        페이지라 따로 디자인이 나오지 않아, 유저에게 서비스 되는 앱의 디자인
        기반으로 비슷한 분위기의 UI구성하는 CSS작업도 했습니다. 스프링웍스(2021
        10. ~ 2022. 01) 퍼블리셔로 일했으며, 입사하자마자 춘천 시청 리뉴얼
        홈페이지 분야 별 메인 페이지와 세부 페이지, 한림대학교 계절 학기
        페이지(개인), 봄의 대화 메인 페이지 전체와 세부 페이지 일부, 경기도
        체육대회와 경기도 장애인 체육대회 홈페이지의 세부 페이지, 강원문화재단의
        CI소개 페이지 & 전체 부분 변경 로고 수정을 했습니다. 자격증은
        정보처리기사와 SQLD 자격증이 있습니다.
      </div> */}
    </div>
  );
};

export default About;
